
var text_content = {
    "1-1": "中共一大的召开标志着中国共产党正式成立，这是中国历史上开天辟地的大事变。中国共产党从一开始就坚持以马克思主义作为行动指南，始终把为中国人民谋幸福、为中华民族谋复兴作为初心和使命。自从有了中国共产党，中国革命的面目就焕然一新了，",
    "1-2": "五四运动是中国近代史上第一次由学生、工人和其他群众共同掀起的反对帝国主义封建军阀的全国规模的爱国运动，是中国旧民主主义革命走向新民主主义革命的转折点，为中国共产党的成立做了思想上干部上的准备。",
    "1-3": "1915年9月，陈独秀在上海创办《青年杂志》，后改名《新青年》，新文化运动由此发端。《新青年》汇聚了李大钊、鲁迅等一批先进知识分子，发表了-系列启蒙性质文章。1917年，陈独秀赴北大任职，《新青年》编辑部也迁到北京。北京大学和《新青年》成为新文化运动的主要阵地。",
    "1-4": "国民大革命的失败使党认识到“枪杆子里面出政权”。1927年8月1日，党领导掌握和影响的武装，在南昌打响了武装反抗国民党反动派的第一枪。南昌起义在全党和全国人民面前树立起一面革命武装斗争的旗帜，是党创建新型人民军队的光辉起点。",
    "2-1": "1945年9月2日，日本在投降书上签字，标志着中国的抗日战争胜利结束。这是近代以来，中国人民第一次取得完全胜利的伟大民族解放战争。抗日战争的胜利，为新民主主义革命的胜利和新中国的创建奠定了坚实的基础，成为中华民族走向复兴的历史转折点。",
    "2-2": "1949年10月1日下午，开国大典在天安门广场隆重举行，毛泽东庄严宣告中华人民共和国中央人民政府成立。中华人民共和国的成立，彻底结束了旧中国半殖民地半封建社会的历史，中国人民从此站立起来，中华民族发展进步开启了新纪元，中国历史揭开了新的篇章，对世界历史进程也产生了深远影响。",
    "2-3": "井冈山革命根据地是大革命失败后中国共产党领导创建的第一个农村革命根据地。1927年10月，毛泽东率领秋收起义部队到达罗霄山脉中段的井冈山，创立了党领导下的农村革命根据地。井冈山革命根据地的创建和斗争，为中国革命指明了方向。",
    "2-4": "长征是党和红军在第五次反“围剿”失败后，从长江南北各根据地向西北地区革命根据地进行的战略大转移。红军长征的胜利，是中国革命转危为安的关键。在长征途中，党和红军广泛播下了革命的种子。伟大的长征精神，成为激励共产党人和人民军队继续前进的强大动力。",
    "3-1": "朝鲜内战爆发后，美国立即出兵干涉，并派遣第七舰队侵入台湾海峡；随后，美军悍然越过三八线，把战火烧到中朝边境。值此危急关头，应朝鲜党和政府请求，中国党和政府作出抗美援朝、保家卫国的历史性决策。经过艰苦卓绝的战斗，中朝军队打破了美军不可战胜的神话，迫使其在停战协定上签字。抗美援朝战争的胜利向世界宣告“西方侵略者几百年来只要在东方一个海岸上架起几尊大炮就可霸占一个国家的时代是一去不复返了”！",
    "3-2": "1971年10月25日，第二十六届联合国大会以压倒性多数通过2758号决议，恢复中华人民共和国在联合国的一切合法权利。11月1日，五星红旗第一次在联合国升起。这是中国外交战线的一个重大胜利。",
    "3-3": "在十年社会主义建设时期，导弹、核弹、人造卫星这“两弹一星”在极端艰苦条件下研制成功，是中华民族为之自豪的伟大成就。热爱祖国、无私奉献、自力更生、艰苦奋斗、大力协同、勇于登攀的“两弹一星”精神，成为全国各族人民宝贵的精神财富和不竭的动力源泉。",
    "3-4": "20世纪70年代初，国际形势的变化促使中美两国关系走向缓和。经过“乒乓外交”、基辛格访华等前期准备后，1972年2月，美国总统尼克松访华。随后中美双方在上海发表《中美联合公报》，标志着两国关系正常化进程的开始。这是中美关系史上的一件大事，也对国际局势产生了重大影响。1979年1月1日，中美两国正式建交。",
    "4-1": "改革开放是党的十一届三中全会作出的历史性抉择，是当代中国最鲜明的特色。改革开放包括对内改革和对外开放。实践充分证明，改革开放是党和人民大踏步赶.上时代的重要法宝，是坚持和发展中国特色社会主义的必由之路，是决定当代中国命运的关键一招，也是决定实现“两个一百年”奋斗目标、实现中华民族伟大复兴的关键一招。",
    "4-2": "1997年7月1日和1999年12月20日，香港、澳门先后回归祖国，“一国两制”从科学构想变成生动实践。香港和澳门回归，开创了港澳两地和祖国内地共同发展新纪元。通过外交谈判并以“一国两制”方式解决香港、澳门问题，是中国人民为世界和平与进步事业作出的重要贡献。",
    "4-3": "“九二共识”是在1992年，海峡两岸关系协会与台湾海峡交流基金会在两岸事务性商谈中，就各自以口头方式表述“海峡两岸均坚持一个中国原则”所达成的共识。“九二共识”体现了一个中国原则，是解决台湾问题的基本前提和根本遵循。",
    "4-4": "家庭联产承包责任制是党的十一届三中全会以后，我国农村改革取得的重大成果，是我国农民的伟大创造。它是指农民以家庭为单位，向集体经济组织承包土地等生产资料和生产任务的农业生产责任制形式。这种制度使农民获得生产和分配的自主权，极大地调动了农民的积极性，解放和发展了农村生产力。",
    "5-1": "2012年9月25日，我国第一艘航空母舰——“辽宁号”正式入列。发展航空母舰，是党中央、国务院、中央军委着眼国家安全和发展全局作出的重大战略决策。“辽宁号”顺利交接入列，对于提高我军现代化水平，促进国防科技工业技术进步和能力建设，增强国防实力和综合国力，对于振奋民族精神，激发爱国热情具有重大而深远的意义。",
    "5-2": "2001年11月10日，在卡塔尔首都多哈举行的世界贸易组织第四届部长级会议，通过了中国加入世界贸易组织的决定。12月11日，中国正式成为世贸组织的第143名成员。加入世界贸易组织，打开了对外开放的新天地，标志着我国对外开放进入一个新的阶段。",
    "5-3": "2008年5月12日， 四川汶川发生里氏8.0级特大地震，造成8.7万人遇难，受灾群众达4625万多人，直接经济损失8451亿多元。在党中央领导下，我国迅速组织起历史上救援速度最快、动员范围最广、投入力量最多的抗震救灾活动。随后用两年多时间，迅速完成了灾后重建。在战胜汶川地震过程中，形成了万众一心、众志成城，不畏艰险、百折不挠，以人为本、尊重科学的伟大抗震救灾精神。",
    "5-4": "2008年8月8日至24日，第二十九届夏季奥运会在北京举行。中国体育代表团在奥运会上居于金牌榜首位，取得了运动成绩和精神文明双丰收。中国人民成功举办了一届有特色、高水平奥运会，实现了中华民族的百年期盼，兑现了对国际社会的郑重承诺，进一步增进了同世界各国人民的相互了解和友谊。",
    "6-1": "2020年，中国政府宣布已经实现了消除绝对贫困的目标，为中国经济社会发展奠定了坚实的基础，有助于消除贫困对社会稳定的不利影响，提高民生水平，促进社会公平正义，增强国家的凝聚力和国际竞争力。同时，中国在全面脱贫方面积累的经验和教训，可以为其他国家和地区消除贫困提供借鉴和启示，有助于推动全球减贫事业的进展。",
    "6-2": "中共共产党成立于1921年，是中国革命的先锋队，历经多次斗争，推翻了清朝和国民政府，建立了中华人民共和国。2021年，中共共产党迎来了它的一百周年纪念，标志着中国共产党成为中国历史上最具影响力的政治力量之一，其提出的新理念、新思想和新战略对中国的发展和变革产生了深远影响，并为其他国家提供了成功的经验和范例，这也是中华民族伟大复兴进程中的一个重要历史和现实事件。",
    "6-3": "“打虎” (take out tigers) “拍蝇” (swat flies) “猎狐”(hunt down foxes)是党的十八大后全面从严治党、加强反腐败斗争的基本措施和手段。“打虎”，强调的是惩治领导干部尤其是高级干部的腐败行为;“拍蝇”，突出的是解决群众身边的不正之风和腐败问题;“ 猎狐”重点对象是在逃境外经济犯罪嫌疑人、在逃境外党员和国家工作人员、涉腐案件在逃境外人员。当前，以“打虎”“拍蝇” “猎狐”为代表的党的反腐败斗争取得了压倒性胜利，为党和国家事业发展提供了坚强保障。",
    "6-4": "“一带一路”是习近平提出的我国扩大开放的重大战略举措和经济外交的顶层设计，是中国特色大国外交的伟大实践。“一带一路”是对我国古代形成的丝绸之路和海上丝绸之路的继承和发展。“一带”是指“丝绸之路经济带”；“一路”是指“21世纪海上丝绸之路”。",
}

function overturn(game, num){
    
    var img = document.getElementById("img"+num);
    var span = document.getElementById("text"+num)
    
    var opacity = img.style.opacity;    // console.log(opacity, opacity==0)
    var low_opacity = 0.00000001
    if (opacity == low_opacity){
        img.style.opacity = 1;
        span.innerHTML = num;
    }
    else{
        img.style.opacity = low_opacity;
        text_index = game+"-"+num
        console.log(text_index)
        span.innerHTML = text_content[text_index];
    }
}

function moreinfo(game, img){
    console.log(game, img)
    window.location.href = "../../End/end.html?level="+game+"&img="+img
    // console.log()
}
